CREATE DATABASE [HUT-MyBase];
CREATE TABLE Товары (
    ID_Товара INT IDENTITY PRIMARY KEY, 
    Название NVARCHAR(255) NOT NULL, 
    Количество_на_складе INT NOT NULL, 
    Цена DECIMAL(10,2) NOT NULL, 
    Единица_измерения NVARCHAR(50) NOT NULL 
);
GO


CREATE TABLE Клиенты (
    ID_Клиента INT IDENTITY PRIMARY KEY, 
    Фамилия NVARCHAR(100) NOT NULL, 
    Имя NVARCHAR(100) NOT NULL, 
    Отчество NVARCHAR(100) NULL, 
    Адрес NVARCHAR(255) NOT NULL, 
    Телефон NVARCHAR(20) NOT NULL, 
    Email NVARCHAR(100) NOT NULL UNIQUE, 
    Признак_скидки BIT DEFAULT 0 -- 
);
GO


CREATE TABLE Заказы (
    ID_Заказа INT IDENTITY PRIMARY KEY, 
    ID_Клиента INT NOT NULL, 
    ID_Товара INT NOT NULL, 
    Количество_заказанного INT NOT NULL CHECK (Количество_заказанного > 0), 
    Дата_продажи DATE NOT NULL,  
    FOREIGN KEY (ID_Клиента) REFERENCES Клиенты(ID_Клиента),
    FOREIGN KEY (ID_Товара) REFERENCES Товары(ID_Товара)
);
GO
INSERT INTO Товары (Название, Количество_на_складе, Цена, Единица_измерения)
VALUES 
('Ноутбук Lenovo', 10, 75000.00, 'шт'),
('Клавиатура Logitech', 50, 3500.00, 'шт'),
('Мышь Razer', 30, 5500.00, 'шт');

INSERT INTO Клиенты (Фамилия, Имя, Отчество, Адрес, Телефон, Email)
VALUES 
('Иванов', 'Алексей', 'Петрович', 'Москва, ул. Ленина, 10', '+79001112233', 'ivanov@mail.ru'),
('Петров', 'Игорь', 'Александрович', 'Санкт-Петербург, Невский пр., 25', '+79112223344', 'petrov@mail.ru');

INSERT INTO Заказы (ID_Клиента, ID_Товара, Количество_заказанного, Дата_продажи)
VALUES 
(1, 1, 1, '2025-02-18'),
(2, 2, 2, '2025-02-18'),
(2, 3, 1, '2025-02-18');
/*lab7*/
/*1*/
SELECT 
    Название AS Товар,
    Цена AS Цена_продажи,
    SUM(Количество_заказанного) AS Общее_количество
FROM 
    Заказы
JOIN 
    Товары ON Заказы.ID_Товара = Товары.ID_Товара
GROUP BY ROLLUP (Название, Цена);
/*2*/
SELECT 
    Название AS Товар,
    Цена AS Цена_продажи,
    SUM(Количество_заказанного) AS Общее_количество
FROM 
    Заказы
JOIN 
    Товары ON Заказы.ID_Товара = Товары.ID_Товара
GROUP BY CUBE (Название, Цена)
ORDER BY Товар, Цена_продажи;
/*3*/
SELECT 
    Клиенты.Фамилия,
    Товары.Название,
    SUM(Количество_заказанного) AS Количество
FROM 
    Заказы
JOIN 
    Клиенты ON Заказы.ID_Клиента = Клиенты.ID_Клиента
JOIN 
    Товары ON Заказы.ID_Товара = Товары.ID_Товара
WHERE 
    Клиенты.Фамилия = 'Иванов'
GROUP BY 
    Клиенты.Фамилия, Товары.Название

UNION ALL

SELECT 
    Клиенты.Фамилия,
    Товары.Название,
    SUM(Количество_заказанного) AS Количество
FROM 
    Заказы
JOIN 
    Клиенты ON Заказы.ID_Клиента = Клиенты.ID_Клиента
JOIN 
    Товары ON Заказы.ID_Товара = Товары.ID_Товара
WHERE 
    Клиенты.Фамилия = 'Петров'
GROUP BY 
    Клиенты.Фамилия, Товары.Название;

/*4*/
SELECT Название
FROM Заказы
JOIN Клиенты ON Заказы.ID_Клиента = Клиенты.ID_Клиента
JOIN Товары ON Заказы.ID_Товара = Товары.ID_Товара
WHERE Клиенты.Фамилия = 'Иванов'

INTERSECT

SELECT Название
FROM Заказы
JOIN Клиенты ON Заказы.ID_Клиента = Клиенты.ID_Клиента
JOIN Товары ON Заказы.ID_Товара = Товары.ID_Товара
WHERE Клиенты.Фамилия = 'Петров';
/*5*/
SELECT Название
FROM Заказы
JOIN Клиенты ON Заказы.ID_Клиента = Клиенты.ID_Клиента
JOIN Товары ON Заказы.ID_Товара = Товары.ID_Товара
WHERE Клиенты.Фамилия = 'Иванов'

EXCEPT


SELECT Название
FROM Заказы
JOIN Клиенты ON Заказы.ID_Клиента = Клиенты.ID_Клиента
JOIN Товары ON Заказы.ID_Товара = Товары.ID_Товара
WHERE Клиенты.Фамилия = 'Петров';